app/Models/Indicadores.php

  public function getData()
  {
    return $this->findAll();
---
SELECT *
FROM "indicadores"

  public function getDataFilter($startDate, $endDate)
  {
    $column = "fechaIndicador";
    return $this->where("$column BETWEEN '$startDate' AND '$endDate'")->findAll();
---
SELECT *
FROM "indicadores"
WHERE "fechaIndicador" BETWEEN '2023-01-11' AND '2023-03-31'

  public function updateData($id, $data)
  {
    return $this->update($id, $data);
---
UPDATE "indicadores" SET "nombreIndicador" = 'BITCOIN', "codigoIndicador" = 'BITCOIN', "unidadMedidaIndicador" = 'Dólar', "valorIndicador" = '1234.2', "fechaIndicador" = '2023-02-25', "tiempoIndicador" = '', "origenIndicador" = 'minicador.cl'
WHERE "indicadores"."id" IN ('121')